'use strict';

//1 Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).

let str = '';

for (let i = 20; i <= 30; i += 0.5) {
    str += i + ' ';
}

console.log(str);

//2 Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.

let str2 = '';

for (let i = 10; i <= 100; i += 10) {
    str2 += `${i}$ * 27 = ${i * 27} \n`;
}

console.log(str2);

//3 Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.

let integer = +prompt('Введіть ціле число');
let listOfIntegers = '';

for (let i = 1; i <= 100; i++) {
    if (i ** 2 <= integer) {
        listOfIntegers += i + '  ';
    } else {
        break;
    }
}

console.log(listOfIntegers);

/*4 Дане ціле число. З'ясувати, чи є воно простим (простим називається число,
більше 1, які не мають інших дільників крім 1 і себе).
 */

let num2 = +prompt('Введіть, будь ласка, ціле число');
let isPrime = true;

for (let i = 2; i < num2; i++) {
    if (num2 % i === 0) {
        isPrime = !isPrime;
        break;
    }
}

console.log(
    isPrime ? `${num2} є простим числом` : `${num2} не є простим числом`
);

/*5 Дане деяке число. Визначити, чи можна одержати це число шляхом
зведення числа 3 у деякий ступінь. (Наприклад, числа 9, 81 можна отримати, а 13 - не можна).
 */

let num = +prompt('Введіть ціле число');
let power;
let result = false;

for (let i = 2; i < num; i++) {
    if (num ** (1 / i) === 3) {
        result = !result;
        power = i;
        break;
    }
}

console.log(
    result
        ? `${num} можна отримати шляхом зведення числа 3 у ступінь числа ${power}`
        : `${num} не можна отримати шляхом зведення числа 3 у деякий ступінь`
);